# -*- coding: utf-8 -*-
# !/usr/bin/python
################################### PART0 DESCRIPTION #################################
# Filename: def_rdd.py
# Description:
#

# Author: Shuai Yuan
# E-mail: ysh329@sina.com
# Create: 2015-8-20 09:05:48
# Last:
__author__ = 'yuens'
################################### PART1 IMPORT ######################################
import MySQLdb
import logging
################################### PART2 CLASS && FUNCTION ###########################
def symbol_stopword_filter(raw_string):
    symbol_stopword_list = [" ", ",", ".", "/", "<", ">", "?",\
                            ";", ":", "'", '"', \
                            "[", "{", "]", "}", "|", "\\",\
                            "`", "~", "!", "@", "#", "$", "%", "^", "&", "*", "(", ")", "-", "_", "+", "=",\
                            "《", "》", "，", "。", "？", "、", "“", "：", "”", "’", "；", "：", "、", "】",\
                            "【", "~", "！", "（", "￥", "）",\
                            " ",\
                            "1", "2", "3", "4", "5", "6", "7", "8", "9", "0",\
                            "一",  "不",  "与",  "且",  "为",  "乃",  "么",  "之",  "呜",  "乌",  "乎",  "呼",\
                            "所",  "也",  "了",  "什",  "从",  "以",  "们",  "但",  "何",  "倘",  "假",  "兮",\
                            "其",  "再",  "别",  "即",  "及",  "另",  "可",  "吗",  "吧",  "嗒",  "吱",  "呀",\
                            "呃",  "呕",  "呗",  "呢",  "呵",  "呸",  "哧",  "咋",  "咚",  "咦",  "咳",  "哇",\
                            "哈",  "哉",  "哎",  "哟",  "哗",  "哦",  "哩",  "哪",  "哼",  "唷",  "唉",  "啊",\
                            "啐",  "啥",  "啦",  "啪",  "喏",  "喔",  "唷",  "嗡",  "嗯",  "嗳",  "嘎",  "嘘",\
                            "嘛",  "嘻",  "嘿",  "因",  "如",  "宁",  "就",  "怎",  "此",  "某",  "每",  "这",\
                            "那",  "兮",  "嗳",  "嗬",  "的"]
    symbol_stopword_list = map(lambda sym: unicode(sym, "utf8"), symbol_stopword_list)
    for word in raw_string:
        if word in symbol_stopword_list: return False
    return  True